## Project - Building a simple ETL Pipeline (CSV into Postgre Database)
 Step 1: Extract the data from the CSV file and load it into a Pandas Dataframe
. Step 2: Transform the data (Remove duplicates, missing data, run calculations etc)
. Step 3: Create a database 
. Step 4: Load the transformed data into the database

In [1]:
# Import libraries
import pandas as pd # For data transformation, manipulation, analysis, calculation, visualisation etc
import psycopg2 # For connecting python to the databse
from sqlalchemy import create_engine # To efficiently manaage and reuse database connection

In [2]:
#Step 1: Extract the data from the CSV file and load it into a Pandas Dataframe .
data = pd.read_csv(r"C:\Users\user\data2bots1\simple_etl_project1\customer sheet(1).csv", encoding='ISO-8859-1')

In [3]:
# view the top 5 rows in the data
data.head()

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,5021,Mexico
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,5023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden

In [4]:
data.tail()

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
86,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,12-Jan,Poland

In [5]:
# providing a general overview of the data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    91 non-null     int64
 1   CustomerName  91 non-null     object
 2   ContactName   91 non-null     object
 3   Address       91 non-null     object
 4   City          91 non-null     object
 5   PostalCode    88 non-null     object
 6   Country       91 non-null     object
dtypes: int64(1), object(6)
memory usage: 5.1+ KB

In [6]:
# Explore missing data within your data
data.isnull().sum()

CustomerID      0
CustomerName    0
ContactName     0
Address         0
City            0
PostalCode      3
Country         0
dtype: int64

In [8]:
# Let's take a look at the missing data in postacode column
data[data['PostalCode'].isnull()]

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
22,23,Folies gourmandes,Martine Rancé,"184, chaussée de Tournai",Lille,NaN,France
33,34,Hanari Carnes,Mario Pontes,"Rua do Paço, 67",Rio de Janeiro,NaN,Brazil
36,37,Hungry Owl All-Night Grocers,Patricia McKenna,8 Johnstown Road,Cork,NaN,Ireland

In [11]:
# Fill in the missing data in the postacode column

data['PostalCode'].fillna('Unknown', inplace=True)

In [12]:
data.isnull().sum()

CustomerID      0
CustomerName    0
ContactName     0
Address         0
City            0
PostalCode      0
Country         0
dtype: int64

In [23]:
#load the dataset into the database

# Database credentials
db_username = 'postgres'
db_password = "abbey4$POSTGRE"
db_host = 'localhost'
db_port = 5432
db_name = '10nalitics simple etl project'

In [24]:
# Establish a connection using SQLAlchemy engine

connection = create_engine(f'postgresql://{db_username}:{db_password}@{db_host}:{db_port}/{db_name}')

In [25]:
# Load the database into the postgres database
data.to_sql('emp_table', connection, if_exists='replace', index=False)

# Close the connection
connection.dispose()